Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg61_cult/pic32cx_sg61_getting_started/firmware/src/packs/PIC32CX1025SG61128_DFP/component/tcc.h
#define TCC_PATT_PGE0_Pos                     _UINT16_(0)                                          /* (TCC_PATT) Pattern Generator 0 Output Enable Position */
#define TCC_PATT_PGE0_Msk                     (_UINT16_(0x1) << TCC_PATT_PGE0_Pos)                 /* (TCC_PATT) Pattern Generator 0 Output Enable Mask */
#define TCC_PATT_PGE0(value)                  (TCC_PATT_PGE0_Msk & (_UINT16_(value) << TCC_PATT_PGE0_Pos)) /* Assigment of value for PGE0 in the TCC_PATT register */
#define TCC_PATT_PGE1_Pos                     _UINT16_(1)                                          /* (TCC_PATT) Pattern Generator 1 Output Enable Position */
#define TCC_PATT_PGE1_Msk                     (_UINT16_(0x1) << TCC_PATT_PGE1_Pos)                 /* (TCC_PATT) Pattern Generator 1 Output Enable Mask */
#define TCC_PATT_PGE1(value)                  (TCC_PATT_PGE1_Msk & (_UINT16_(value) << TCC_PATT_PGE1_Pos)) /* Assigment of value for PGE1 in the TCC_PATT register */
#define TCC_PATT_PGE2_Pos                     _UINT16_(2)                                          /* (TCC_PATT) Pattern Generator 2 Output Enable Position */
#define TCC_PATT_PGE2_Msk                     (_UINT16_(0x1) << TCC_PATT_PGE2_Pos)                 /* (TCC_PATT) Pattern Generator 2 Output Enable Mask */
#define TCC_PATT_PGE2(value)                  (TCC_PATT_PGE2_Msk & (_UINT16_(value) << TCC_PATT_PGE2_Pos)) /* Assigment of value for PGE2 in the TCC_PATT register */
#define TCC_PATT_PGE3_Pos                     _UINT16_(3)                                          /* (TCC_PATT) Pattern Generator 3 Output Enable Position */
#define TCC_PATT_PGE3_Msk                     (_UINT16_(0x1) << TCC_PATT_PGE3_Pos)                 /* (TCC_PATT) Pattern Generator 3 Output Enable Mask */
#define TCC_PATT_PGE3(value)                  (TCC_PATT_PGE3_Msk & (_UINT16_(value) << TCC_PATT_PGE3_Pos)) /* Assigment of value for PGE3 in the TCC_PATT register */
#define TCC_PATT_PGE4_Pos                     _UINT16_(4)                                          /* (TCC_PATT) Pattern Generator 4 Output Enable Position */
#define TCC_PATT_PGE4_Msk                     (_UINT16_(0x1) << TCC_PATT_PGE4_Pos)                 /* (TCC_PATT) Pattern Generator 4 Output Enable Mask */
#define TCC_PATT_PGE4(value)                  (TCC_PATT_PGE4_Msk & (_UINT16_(value) << TCC_PATT_PGE4_Pos)) /* Assigment of value for PGE4 in the TCC_PATT register */
#define TCC_PATT_PGE5_Pos                     _UINT16_(5)                                          /* (TCC_PATT) Pattern Generator 5 Output Enable Position */
#define TCC_PATT_PGE5_Msk                     (_UINT16_(0x1) << TCC_PATT_PGE5_Pos)                 /* (TCC_PATT) Pattern Generator 5 Output Enable Mask */
#define TCC_PATT_PGE5(value)                  (TCC_PATT_PGE5_Msk & (_UINT16_(value) << TCC_PATT_PGE5_Pos)) /* Assigment of value for PGE5 in the TCC_PATT register */
#define TCC_PATT_PGE6_Pos                     _UINT16_(6)                                          /* (TCC_PATT) Pattern Generator 6 Output Enable Position */
#define TCC_PATT_PGE6_Msk                     (_UINT16_(0x1) << TCC_PATT_PGE6_Pos)                 /* (TCC_PATT) Pattern Generator 6 Output Enable Mask */
#define TCC_PATT_PGE6(value)                  (TCC_PATT_PGE6_Msk & (_UINT16_(value) << TCC_PATT_PGE6_Pos)) /* Assigment of value for PGE6 in the TCC_PATT register */
#define TCC_PATT_PGE7_Pos                     _UINT16_(7)                                          /* (TCC_PATT) Pattern Generator 7 Output Enable Position */
#define TCC_PATT_PGE7_Msk                     (_UINT16_(0x1) << TCC_PATT_PGE7_Pos)                 /* (TCC_PATT) Pattern Generator 7 Output Enable Mask */
#define TCC_PATT_PGE7(value)                  (TCC_PATT_PGE7_Msk & (_UINT16_(value) << TCC_PATT_PGE7_Pos)) /* Assigment of value for PGE7 in the TCC_PATT register */
#define TCC_PATT_PGV0_Pos                     _UINT16_(8)                                          /* (TCC_PATT) Pattern Generator 0 Output Value Position */
#define TCC_PATT_PGV0_Msk                     (_UINT16_(0x1) << TCC_PATT_PGV0_Pos)                 /* (TCC_PATT) Pattern Generator 0 Output Value Mask */
#define TCC_PATT_PGV0(value)                  (TCC_PATT_PGV0_Msk & (_UINT16_(value) << TCC_PATT_PGV0_Pos)) /* Assigment of value for PGV0 in the TCC_PATT register */
#define TCC_PATT_PGV1_Pos                     _UINT16_(9)                                          /* (TCC_PATT) Pattern Generator 1 Output Value Position */
#define TCC_PATT_PGV1_Msk                     (_UINT16_(0x1) << TCC_PATT_PGV1_Pos)                 /* (TCC_PATT) Pattern Generator 1 Output Value Mask */
#define TCC_PATT_PGV1(value)                  (TCC_PATT_PGV1_Msk & (_UINT16_(value) << TCC_PATT_PGV1_Pos)) /* Assigment of value for PGV1 in the TCC_PATT register */
#define TCC_PATT_PGV2_Pos                     _UINT16_(10)                                         /* (TCC_PATT) Pattern Generator 2 Output Value Position */
#define TCC_PATT_PGV2_Msk                     (_UINT16_(0x1) << TCC_PATT_PGV2_Pos)                 /* (TCC_PATT) Pattern Generator 2 Output Value Mask */
#define TCC_PATT_PGV2(value)                  (TCC_PATT_PGV2_Msk & (_UINT16_(value) << TCC_PATT_PGV2_Pos)) /* Assigment of value for PGV2 in the TCC_PATT register */
#define TCC_PATT_PGV3_Pos                     _UINT16_(11)                                         /* (TCC_PATT) Pattern Generator 3 Output Value Position */
#define TCC_PATT_PGV3_Msk                     (_UINT16_(0x1) << TCC_PATT_PGV3_Pos)                 /* (TCC_PATT) Pattern Generator 3 Output Value Mask */
#define TCC_PATT_PGV3(value)                  (TCC_PATT_PGV3_Msk & (_UINT16_(value) << TCC_PATT_PGV3_Pos)) /* Assigment of value for PGV3 in the TCC_PATT register */
#define TCC_PATT_PGV4_Pos                     _UINT16_(12)                                         /* (TCC_PATT) Pattern Generator 4 Output Value Position */
#define TCC_PATT_PGV4_Msk                     (_UINT16_(0x1) << TCC_PATT_PGV4_Pos)                 /* (TCC_PATT) Pattern Generator 4 Output Value Mask */
#define TCC_PATT_PGV4(value)                  (TCC_PATT_PGV4_Msk & (_UINT16_(value) << TCC_PATT_PGV4_Pos)) /* Assigment of value for PGV4 in the TCC_PATT register */
#define TCC_PATT_PGV5_Pos                     _UINT16_(13)                                         /* (TCC_PATT) Pattern Generator 5 Output Value Position */
#define TCC_PATT_PGV5_Msk                     (_UINT16_(0x1) << TCC_PATT_PGV5_Pos)                 /* (TCC_PATT) Pattern Generator 5 Output Value Mask */
#define TCC_PATT_PGV5(value)                  (TCC_PATT_PGV5_Msk & (_UINT16_(value) << TCC_PATT_PGV5_Pos)) /* Assigment of value for PGV5 in the TCC_PATT register */
#define TCC_PATT_PGV6_Pos                     _UINT16_(14)                                         /* (TCC_PATT) Pattern Generator 6 Output Value Position */
#define TCC_PATT_PGV6_Msk                     (_UINT16_(0x1) << TCC_PATT_PGV6_Pos)                 /* (TCC_PATT) Pattern Generator 6 Output Value Mask */
#define TCC_PATT_PGV6(value)                  (TCC_PATT_PGV6_Msk & (_UINT16_(value) << TCC_PATT_PGV6_Pos)) /* Assigment of value for PGV6 in the TCC_PATT register */
#define TCC_PATT_PGV7_Pos                     _UINT16_(15)                                         /* (TCC_PATT) Pattern Generator 7 Output Value Position */
#define TCC_PATT_PGV7_Msk                     (_UINT16_(0x1) << TCC_PATT_PGV7_Pos)                 /* (TCC_PATT) Pattern Generator 7 Output Value Mask */
#define TCC_PATT_PGV7(value)                  (TCC_PATT_PGV7_Msk & (_UINT16_(value) << TCC_PATT_PGV7_Pos)) /* Assigment of value for PGV7 in the TCC_PATT register */
#define TCC_PATT_Msk                          _UINT16_(0xFFFF)                                     /* (TCC_PATT) Register Mask  */

#define TCC_PATT_PGE_Pos                      _UINT16_(0)                                          /* (TCC_PATT Position) Pattern Generator x Output Enable */
#define TCC_PATT_PGE_Msk                      (_UINT16_(0xFF) << TCC_PATT_PGE_Pos)                 /* (TCC_PATT Mask) PGE */
#define TCC_PATT_PGE(value)                   (TCC_PATT_PGE_Msk & (_UINT16_(value) << TCC_PATT_PGE_Pos)) 
#define TCC_PATT_PGV_Pos                      _UINT16_(8)                                          /* (TCC_PATT Position) Pattern Generator 7 Output Value */
#define TCC_PATT_PGV_Msk                      (_UINT16_(0xFF) << TCC_PATT_PGV_Pos)                 /* (TCC_PATT Mask) PGV */
#define TCC_PATT_PGV(value)                   (TCC_PATT_PGV_Msk & (_UINT16_(value) << TCC_PATT_PGV_Pos)) 

/* -------- TCC_PATTBUF : (TCC Offset: 0x64) (R/W 16) Pattern Buffer -------- */
#define TCC_PATTBUF_RESETVALUE                _UINT16_(0x00)                                       /*  (TCC_PATTBUF) Pattern Buffer  Reset Value */

#define TCC_PATTBUF_PGEB0_Pos                 _UINT16_(0)                                          /* (TCC_PATTBUF) Pattern Generator 0 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB0_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGEB0_Pos)             /* (TCC_PATTBUF) Pattern Generator 0 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB0(value)              (TCC_PATTBUF_PGEB0_Msk & (_UINT16_(value) << TCC_PATTBUF_PGEB0_Pos)) /* Assigment of value for PGEB0 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGEB1_Pos                 _UINT16_(1)                                          /* (TCC_PATTBUF) Pattern Generator 1 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB1_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGEB1_Pos)             /* (TCC_PATTBUF) Pattern Generator 1 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB1(value)              (TCC_PATTBUF_PGEB1_Msk & (_UINT16_(value) << TCC_PATTBUF_PGEB1_Pos)) /* Assigment of value for PGEB1 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGEB2_Pos                 _UINT16_(2)                                          /* (TCC_PATTBUF) Pattern Generator 2 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB2_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGEB2_Pos)             /* (TCC_PATTBUF) Pattern Generator 2 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB2(value)              (TCC_PATTBUF_PGEB2_Msk & (_UINT16_(value) << TCC_PATTBUF_PGEB2_Pos)) /* Assigment of value for PGEB2 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGEB3_Pos                 _UINT16_(3)                                          /* (TCC_PATTBUF) Pattern Generator 3 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB3_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGEB3_Pos)             /* (TCC_PATTBUF) Pattern Generator 3 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB3(value)              (TCC_PATTBUF_PGEB3_Msk & (_UINT16_(value) << TCC_PATTBUF_PGEB3_Pos)) /* Assigment of value for PGEB3 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGEB4_Pos                 _UINT16_(4)                                          /* (TCC_PATTBUF) Pattern Generator 4 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB4_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGEB4_Pos)             /* (TCC_PATTBUF) Pattern Generator 4 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB4(value)              (TCC_PATTBUF_PGEB4_Msk & (_UINT16_(value) << TCC_PATTBUF_PGEB4_Pos)) /* Assigment of value for PGEB4 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGEB5_Pos                 _UINT16_(5)                                          /* (TCC_PATTBUF) Pattern Generator 5 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB5_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGEB5_Pos)             /* (TCC_PATTBUF) Pattern Generator 5 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB5(value)              (TCC_PATTBUF_PGEB5_Msk & (_UINT16_(value) << TCC_PATTBUF_PGEB5_Pos)) /* Assigment of value for PGEB5 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGEB6_Pos                 _UINT16_(6)                                          /* (TCC_PATTBUF) Pattern Generator 6 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB6_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGEB6_Pos)             /* (TCC_PATTBUF) Pattern Generator 6 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB6(value)              (TCC_PATTBUF_PGEB6_Msk & (_UINT16_(value) << TCC_PATTBUF_PGEB6_Pos)) /* Assigment of value for PGEB6 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGEB7_Pos                 _UINT16_(7)                                          /* (TCC_PATTBUF) Pattern Generator 7 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB7_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGEB7_Pos)             /* (TCC_PATTBUF) Pattern Generator 7 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB7(value)              (TCC_PATTBUF_PGEB7_Msk & (_UINT16_(value) << TCC_PATTBUF_PGEB7_Pos)) /* Assigment of value for PGEB7 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGVB0_Pos                 _UINT16_(8)                                          /* (TCC_PATTBUF) Pattern Generator 0 Output Enable Position */
#define TCC_PATTBUF_PGVB0_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGVB0_Pos)             /* (TCC_PATTBUF) Pattern Generator 0 Output Enable Mask */
#define TCC_PATTBUF_PGVB0(value)              (TCC_PATTBUF_PGVB0_Msk & (_UINT16_(value) << TCC_PATTBUF_PGVB0_Pos)) /* Assigment of value for PGVB0 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGVB1_Pos                 _UINT16_(9)                                          /* (TCC_PATTBUF) Pattern Generator 1 Output Enable Position */
#define TCC_PATTBUF_PGVB1_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGVB1_Pos)             /* (TCC_PATTBUF) Pattern Generator 1 Output Enable Mask */
#define TCC_PATTBUF_PGVB1(value)              (TCC_PATTBUF_PGVB1_Msk & (_UINT16_(value) << TCC_PATTBUF_PGVB1_Pos)) /* Assigment of value for PGVB1 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGVB2_Pos                 _UINT16_(10)                                         /* (TCC_PATTBUF) Pattern Generator 2 Output Enable Position */
#define TCC_PATTBUF_PGVB2_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGVB2_Pos)             /* (TCC_PATTBUF) Pattern Generator 2 Output Enable Mask */
#define TCC_PATTBUF_PGVB2(value)              (TCC_PATTBUF_PGVB2_Msk & (_UINT16_(value) << TCC_PATTBUF_PGVB2_Pos)) /* Assigment of value for PGVB2 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGVB3_Pos                 _UINT16_(11)                                         /* (TCC_PATTBUF) Pattern Generator 3 Output Enable Position */
#define TCC_PATTBUF_PGVB3_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGVB3_Pos)             /* (TCC_PATTBUF) Pattern Generator 3 Output Enable Mask */
#define TCC_PATTBUF_PGVB3(value)              (TCC_PATTBUF_PGVB3_Msk & (_UINT16_(value) << TCC_PATTBUF_PGVB3_Pos)) /* Assigment of value for PGVB3 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGVB4_Pos                 _UINT16_(12)                                         /* (TCC_PATTBUF) Pattern Generator 4 Output Enable Position */
#define TCC_PATTBUF_PGVB4_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGVB4_Pos)             /* (TCC_PATTBUF) Pattern Generator 4 Output Enable Mask */
#define TCC_PATTBUF_PGVB4(value)              (TCC_PATTBUF_PGVB4_Msk & (_UINT16_(value) << TCC_PATTBUF_PGVB4_Pos)) /* Assigment of value for PGVB4 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGVB5_Pos                 _UINT16_(13)                                         /* (TCC_PATTBUF) Pattern Generator 5 Output Enable Position */
#define TCC_PATTBUF_PGVB5_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGVB5_Pos)             /* (TCC_PATTBUF) Pattern Generator 5 Output Enable Mask */
#define TCC_PATTBUF_PGVB5(value)              (TCC_PATTBUF_PGVB5_Msk & (_UINT16_(value) << TCC_PATTBUF_PGVB5_Pos)) /* Assigment of value for PGVB5 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGVB6_Pos                 _UINT16_(14)                                         /* (TCC_PATTBUF) Pattern Generator 6 Output Enable Position */
#define TCC_PATTBUF_PGVB6_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGVB6_Pos)             /* (TCC_PATTBUF) Pattern Generator 6 Output Enable Mask */
#define TCC_PATTBUF_PGVB6(value)              (TCC_PATTBUF_PGVB6_Msk & (_UINT16_(value) << TCC_PATTBUF_PGVB6_Pos)) /* Assigment of value for PGVB6 in the TCC_PATTBUF register */
#define TCC_PATTBUF_PGVB7_Pos                 _UINT16_(15)                                         /* (TCC_PATTBUF) Pattern Generator 7 Output Enable Position */
#define TCC_PATTBUF_PGVB7_Msk                 (_UINT16_(0x1) << TCC_PATTBUF_PGVB7_Pos)             /* (TCC_PATTBUF) Pattern Generator 7 Output Enable Mask */
#define TCC_PATTBUF_PGVB7(value)              (TCC_PATTBUF_PGVB7_Msk & (_UINT16_(value) << TCC_PATTBUF_PGVB7_Pos)) /* Assigment of value for PGVB7 in the TCC_PATTBUF register */
#define TCC_PATTBUF_Msk                       _UINT16_(0xFFFF)                                     /* (TCC_PATTBUF) Register Mask  */

#define TCC_PATTBUF_PGEB_Pos                  _UINT16_(0)                                          /* (TCC_PATTBUF Position) Pattern Generator x Output Enable Buffer */
#define TCC_PATTBUF_PGEB_Msk                  (_UINT16_(0xFF) << TCC_PATTBUF_PGEB_Pos)             /* (TCC_PATTBUF Mask) PGEB */
#define TCC_PATTBUF_PGEB(value)               (TCC_PATTBUF_PGEB_Msk & (_UINT16_(value) << TCC_PATTBUF_PGEB_Pos)) 
#define TCC_PATTBUF_PGVB_Pos                  _UINT16_(8)                                          /* (TCC_PATTBUF Position) Pattern Generator 7 Output Enable */
#define TCC_PATTBUF_PGVB_Msk                  (_UINT16_(0xFF) << TCC_PATTBUF_PGVB_Pos)             /* (TCC_PATTBUF Mask) PGVB */
#define TCC_PATTBUF_PGVB(value)               (TCC_PATTBUF_PGVB_Msk & (_UINT16_(value) << TCC_PATTBUF_PGVB_Pos)) 

/* -------- TCC_PER : (TCC Offset: 0x40) (R/W 32) Period -------- */
#define TCC_PER_RESETVALUE                    _UINT32_(0xFFFFFFFF)                                 /*  (TCC_PER) Period  Reset Value */

#define TCC_PER_PER_Pos                       _UINT32_(0)                                          /* (TCC_PER) Period Value Position */
#define TCC_PER_PER_Msk                       (_UINT32_(0xFFFFFF) << TCC_PER_PER_Pos)              /* (TCC_PER) Period Value Mask */
#define TCC_PER_PER(value)                    (TCC_PER_PER_Msk & (_UINT32_(value) << TCC_PER_PER_Pos)) /* Assigment of value for PER in the TCC_PER register */
#define TCC_PER_Msk                           _UINT32_(0x00FFFFFF)                                 /* (TCC_PER) Register Mask  */

/* DITH4 mode */
#define TCC_PER_DITH4_DITHER_Pos              _UINT32_(0)                                          /* (TCC_PER) Dithering Cycle Number Position */
#define TCC_PER_DITH4_DITHER_Msk              (_UINT32_(0xF) << TCC_PER_DITH4_DITHER_Pos)          /* (TCC_PER) Dithering Cycle Number Mask */
#define TCC_PER_DITH4_DITHER(value)           (TCC_PER_DITH4_DITHER_Msk & (_UINT32_(value) << TCC_PER_DITH4_DITHER_Pos))
#define TCC_PER_DITH4_PER_Pos                 _UINT32_(4)                                          /* (TCC_PER) Period Value Position */
#define TCC_PER_DITH4_PER_Msk                 (_UINT32_(0xFFFFF) << TCC_PER_DITH4_PER_Pos)         /* (TCC_PER) Period Value Mask */
#define TCC_PER_DITH4_PER(value)              (TCC_PER_DITH4_PER_Msk & (_UINT32_(value) << TCC_PER_DITH4_PER_Pos))
#define TCC_PER_DITH4_Msk                     _UINT32_(0x00FFFFFF)                                  /* (TCC_PER_DITH4) Register Mask  */

